# coding:utf-8
'''
@author: 猫大白
Project:Python的基础数据类型&基本运算符
'''

print('**********基础运算符实战**********')

print('两数相加的和：',3+2)  # 相加
print('两数相减的差：',6-2)  # 相减
print('两数相乘的积：',3*2)  # 相乘
print('两数相除的商：',8/2)  # 相除
print('两数相除取余数，结果为：',7%2)  # 相除取余数
print('两数相除取商的整数，结果为：',9//2)  # 相除取商的整数
print('m的n次方结果为：',6**2)  # m的n次方
print('--------------------------------------------------------')

print('**********比较运算符实战**********')
a = 3
b = 2
print('a是否等于b？',a == b)  # 等于
print('a是否不等于b？',a != b)  # 不等于
print('a是否大于b？',a>b)  # 大于
print('a是否大于等于b？',a>=b)  # 大于等于
print('a是否小于b？',a<b)  # 小于
print('a是否小于等于b？',a<=b)  # 小于等于
print('--------------------------------------------------------')

print('**********成员包含符实战**********')
list_a = [1,2,3,4,5]
A = 1
print('A在list_a中？',A in list_a)  # 包含
print('A不在list_a中？',A not in list_a)  # 不包含
print('--------------------------------------------------------')

print('**********逻辑运算符实战**********')
print(not 3>2)  # 非
print(3>2 and 5>3)  # 并
print(3>2 or 4>5)  # 或
print('--------------------------------------------------------')

print('**********复合赋值运算符实战**********')
a1 = 10
a2 = 8
a1+=a2 # a1 = a1 + a2
print(a1)
print('--------------------------------------------------------')

print('**********身份运算符实战**********')
"""
python仅仅对比较小的整数对象（范围[-5,256]）缓存起来，所以对应该范围值的is对比是True
pycharm和python的运行结果可能不一致，已交互为主

== 和 is 的区别：
    ==比较的是两个变量的值是否相等；
    is比较的是两个变量的id值是否相同
"""
a3 = 1000
a4 = 1000
print(id(a3))
print(id(a4))

print('a3是否等于a4？',a3==a4)
print('a3是否和a4相同？',a3 is a4)
print('--------------------------------------------------------')

# 交叉赋值
m = 3
n = 5
m,n = n,m

print("m是:%d,n是:%d"%(m,n))

